# upper()-მას შეუძლია ტერმინალში დიდი ასოებით დაბეჭდოს ტექსტი.
# lower()-მას შეუძლია ტერმინალში პატარა ასოებით დაბეჭდოს ტექსტი.
# capitalize()-მას შეუძლია ტერმინალში დაბეჭდოს ტექსტის პირველი ასო დიდი ასოთი.
# find()-მას შეუძლია მოძებნოს ტექსტში კონკრეტული ასო ან სიტყვა და დაბეჭდოს მისი პოზიცია.
# count()-მას შეუძლია დაითვალოს რამდენჯერ გვხვდება კონკრეტული ასო ან სიტყვა ტექსტში.
# len()-მას შეუძლია დაითვალოს რამდენი ასო ან სიტყვა გვხვდება ტექსტში.
# endwith()-მას შეუძლია შეამოწმოს ტექსტი კონკრეტული ასოთი ან სიტყვით მთავრდება თუ არა.
# startswith()-მას შეუძლია შეამოწმოს ტექსტი კონკრეტული ასოთი ან სიტყვით იწყება თუ არა.

# winadadeba=input("შეიყვანეთ ტექსტი: ")
# print(winadadeba.upper())

# email=input("შეიყვანეთ თქვენი ელ-ფოსტა: ")
# print(email.lower())

# book=input("შეიყვანეთ წიგნის დასახელება: ")
# print(book.capitalize())

# symbol=input("შეიყვანეთ წინადადება და სიმბოლო: ")
# print(symbol.find("a"))


sityva = input("შემოიტანეთ სიტყვა: ")


if sityva.isupper():
    print("სიტყვა უკვე დიდია!")
else:

    didi_sityva = sityva.upper()
    print(didi_sityva)

