

ცარიელი_სია = [] 
ჩემი_სია = [10, 20, 30]


სახელები = ["ანი", "გიორგი", "ლუკა", "ნინო", "დათო", "მარიამი", "ალექსი"]
print("თავდაპირველი სია:", სახელები)

სახელები[1] = "ნიკა"
სახელები[5] = "ლიზა"

print("შეცვლილი სია:", სახელები)
print("-" * 40)




სხვადასხვა_სია = ["Python", 100, "Java", True, 3.14, "C++", "JS", False]


ელემენტი_2 = სხვადასხვა_სია[1]
ელემენტი_4 = სხვადასხვა_სია[3]
ელემენტი_6 = სხვადასხვა_სია[5]

print(f"მე-2 ელემენტი (ინდექსი 1): {ელემენტი_2}")
print(f"მე-4 ელემენტი (ინდექსი 3): {ელემენტი_4}")
print(f"მე-6 ელემენტი (ინდექსი 5): {ელემენტი_6}")
print("-" * 40)



ხილი = ["ვაშლი", "ბანანი", "ფორთოხალი"] 