

#  5 მაგალითი, რომელიც აბრუნებს TRUE 
print(10 > 5)                   
print(7 == 7)                    
print(4 != 9)                    
print((5 > 2) and (10 == 10))    
print((3 == 4) or (8 > 1))       

#5 მაგალითი, რომელიც აბრუნებს FALSE
print(3 > 8)                    
print(15 <= 10)                  
print(6 == 9)                    
print((10 > 5) and (2 == 3))     
print(5 != 5)             



# დავალება 3: ძირითადი კონცეფციები
 

#Sequencing (თანმიმდევრობა): ეს არის კოდის კითხვისა და შესრულების ჩვეულებრივი
#პრინციპი — პროგრამა ეშვება ზემოდან ქვემოთ, ნაბიჯ-ნაბიჯ, ხაზების მიყოლებით.
   
#Selection (შერჩევა/პირობა): ეს მაშინ ხდება, როცა პროგრამას უწევს გადაწყვეტილების
#მიღება. ვიყენებთ 'if', 'elif' და 'else' კონსტრუქციებს. კოდის გარკვეული ნაწილი
#შესრულდება მხოლოდ იმ შემთხვევაში, თუ პირობა ჭეშმარიტია (True).
   
#Iteration (იტერაცია/ციკლი): ეს ნიშნავს კოდის ერთი და იმავე ბლოკის მრავალჯერად 
#გამეორებას მანამ, სანამ რაიმე პირობა სრულდება ან სანამ რაიმე სიას ბოლომდე არ ჩავუყვებით.




# დავალება 4: რა არის For Loop

#For loop არის ციკლის სახეობა, რომელიც გვეხმარება კოდის გარკვეული ნაწილის 
# წინასწარ განსაზღვრული რაოდენობით გამეორებაში. ის გვიზოგავს დროსა და ენერგიას, 
# რათა ერთი და იგივე ხაზი ხელით ასჯერ არ ვწეროთ. ასევე იდეალურია სიებში (lists) 
# თითოეული ელემენტის სათითაოდ გადასარჩევად.




# დავალება 5: range() ფუნქცია და For Loop




for i in range(10):
    print("სუბარუ")



for i in range(100):
    print("სანდრო")



for i in range(46):
    print("ლურჯი")



for i in range(32):
    print("ს")